ЧартерEDT.Расширение1/src/Documents/чартер_ЗаписьНаРейс/чартер_ЗаписьНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>чартер_ЗаписьНаРейс</name>
  <registerRecords>InformationRegister.чартер_ЗаписьНаРейс</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВылета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SLIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКакойНОТеЗаявлены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНаРейсе</name>
    <type>
      <types>EnumRef.чартер_СтатусыНаРейсе</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.чартер_ПосадочныеМестаНаРейс</types>
    </type>
  </attributes>
  <attributes>
    <name>СКемПосадить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйБагаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ЗаписьНаРейс/чартер_ЗаписьНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_ЗаписьНаРейс</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусНаРейсе</name>
    <type>
      <types>EnumRef.чартер_СтатусыНаРейсе</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйБагаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВылета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SLIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКакойНОТеЗаявлены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.чартер_ПосадочныеМестаНаРейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Enums/чартер_СтатусыНаРейсе/чартер_СтатусыНаРейсе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>чартер_СтатусыНаРейсе</name>
  <enumValues>
    <name>ЗаписанНаРейс</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьУдалена</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьПеренесенаНаДругойРейс</name>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Enums/чартер_КлассыМестВС/чартер_КлассыМестВС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>чартер_КлассыМестВС</name>
  <enumValues>
    <name>БизнесКласс</name>
  </enumValues>
  <enumValues>
    <name>ЭкономическийКлассУлучшенный</name>
  </enumValues>
  <enumValues>
    <name>ЭкономическийКласс</name>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/чартер_Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_Рейсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКвотаНаОрганизацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПерелета</name>
    <type>
      <types>CatalogRef.чартер_МаршрутыПерелета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПолета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортРейсаЗагружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БортСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квотирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.чартер_Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КвотаНаРейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Documents/чартер_ЗаписьНаРейс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выгрузка списка записанных на борт сотрудников для сопоставления данных из ЗУП
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент
//	Рейс			  - СправочникСсылка.чартер_Рейсы
// 
Процедура ВыгрузитьЗаписьНаРейс(ТабличныйДокумент, Рейс) Экспорт
	
	ТабличныйДокумент.Очистить();

	Макет = ПолучитьМакет("ПФ_MXL_Список");	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаВыгрузкиСписка();
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
		
КонецПроцедуры

// Формирование посадочного талона в зависимости от выбранного класса
//
// Параметры:
// 	ШаблонБилета - ТабличныйДокумент
// 	СтруктураПосадочногоТалона - Структура - Выбранное место, Тип кампановкиВС.
//
Процедура СформироватьБилетНаРейсДляСотрудника(ШаблонБилета, СтруктураПосадочногоТалона) Экспорт
	
	ШаблонБилета.Очистить();                             
	
	КлассМестаВС = Справочники.чартер_ПосадочныеМестаНаРейс.ПоолучитьКлассМестаВС(СтруктураПосадочногоТалона.Место
																				, СтруктураПосадочногоТалона.Рейс.ТипВС);
	Макет = ПолучитьОбщийМакет(ПолучитьШаблонПосадочногоТалона(КлассМестаВС));
	
	Если НЕ Макет = Неопределено Тогда

		ОбластьДанных = Макет.ПолучитьОбласть("Билет");
	
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТестЗапросаПосадочногоТалона();
		Запрос.УстановитьПараметр("Рейс", СтруктураПосадочногоТалона.Рейс);
		Запрос.УстановитьПараметр("Сотрудник", СтруктураПосадочногоТалона.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			ЗаполнитьЗначенияСвойств(ОбластьДанных.Параметры, Выборка);
			
		КонецЦикла;
		
		ШаблонБилета.Вывести(ОбластьДанных);
	Иначе
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Не удалось получить данные для формирования билета."); 

	КонецЕсли;
		
КонецПроцедуры

// Получить количество пассажиров на рейсе.
// 
// Параметры:
//  Рейс - СправочникСсылка
// 
// Возвращаемое значение:
//  Число - Число 
//
Функция ПолучитьКоличествоПассажировНаРейсе(Рейс) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	КОЛИЧЕСТВО(чартер_ЗаписьНаРейс.Ссылка) КАК КоличествоПассажиров
					|ИЗ
					|	Документ.чартер_ЗаписьНаРейс КАК чартер_ЗаписьНаРейс
					|ГДЕ
					|	чартер_ЗаписьНаРейс.Проведен
					|	И НЕ чартер_ЗаписьНаРейс.ПометкаУдаления
					|	И чартер_ЗаписьНаРейс.Рейс = &Рейс
					|	И чартер_ЗаписьНаРейс.СтатусНаРейсе = ЗНАЧЕНИЕ(Перечисление.чартер_СтатусыНаРейсе.ЗаписанНаРейс)";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
	    Возврат Выборка.КоличествоПассажиров; 
	КонецЕсли;
	
КонецФункции

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаВыгрузкиСписка()

	ТекстЗапроса = "ВЫБРАТЬ
					|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
					|	чартер_ЗаписьНаРейс.Организация.Представление КАК ОрганизацияПредставление,
					|	чартер_ЗаписьНаРейс.ТабельныйНомер КАК ТабельныйНомер,
					|	чартер_ЗаписьНаРейс.ФИО КАК ФИО,
					|	чартер_ЗаписьНаРейс.Должность КАК Должность,
					|	чартер_ЗаписьНаРейс.Подразделение КАК Подразделение,
					|	чартер_ЗаписьНаРейс.ПричиныВылета КАК ПричиныВылета,
					|	чартер_ЗаписьНаРейс.SLIP КАК SLIP,
					|	чартер_ЗаписьНаРейс.НомерТелефона КАК НомерТелефона,
					|	чартер_ЗаписьНаРейс.Комментарий КАК Комментарий,
					|	чартер_ЗаписьНаРейс.ВКакойНОТеЗаявлены КАК ВКакойНОТеЗаявлены,
					|	чартер_ЗаписьНаРейс.Исполнитель КАК Исполнитель,
					|	чартер_ЗаписьНаРейс.ДатаИзменения КАК ДатаИзменения
					|ПОМЕСТИТЬ втИсходныеДанные
					|ИЗ
					|	Документ.чартер_ЗаписьНаРейс КАК чартер_ЗаписьНаРейс
					|ГДЕ
					|	чартер_ЗаписьНаРейс.Рейс = &Рейс
					|	И чартер_ЗаписьНаРейс.Проведен
					|	И НЕ чартер_ЗаписьНаРейс.ПометкаУдаления
					|	И чартер_ЗаписьНаРейс.СтатусНаРейсе = ЗНАЧЕНИЕ(Перечисление.чартер_СтатусыНаРейсе.ЗаписанНаРейс)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	втИсходныеДанные.НомерСтроки КАК НомерСтроки,
					|	втИсходныеДанные.ОрганизацияПредставление КАК Организация,
					|	втИсходныеДанные.ТабельныйНомер КАК ТабельныйНомер,
					|	втИсходныеДанные.ФИО КАК ФИО,
					|	втИсходныеДанные.Должность КАК Должность,
					|	втИсходныеДанные.Подразделение КАК Отдел,
					|	втИсходныеДанные.ПричиныВылета КАК ПричиныВылета,
					|	втИсходныеДанные.SLIP КАК SLIP,
					|	втИсходныеДанные.НомерТелефона КАК НомерТелефона,
					|	втИсходныеДанные.Комментарий КАК Комментарий,
					|	втИсходныеДанные.ВКакойНОТеЗаявлены КАК ВКакойНОТеЗаявлены,
					|	втИсходныеДанные.Исполнитель КАК Исполнитель,
					|	втИсходныеДанные.ДатаИзменения КАК ДатаИзменения
					|ИЗ
					|	втИсходныеДанные КАК втИсходныеДанные";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ПолучитьТестЗапросаПосадочногоТалона()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	чартер_ЗаписьНаРейс.Организация КАК Организация,
	               |	чартер_ЗаписьНаРейс.ФИО КАК ФИО,
	               |	чартер_ЗаписьНаРейс.ФИОАнглийское КАК ФИОАнглийское,
	               |	чартер_ЗаписьНаРейс.Место КАК Место,
	               |	чартер_ЗаписьНаРейс.Рейс КАК Рейс,
	               |	чартер_ЗаписьНаРейс.ДополнительныйБагаж КАК ДополнительныйБагаж
	               |ПОМЕСТИТЬ втРегистацияСотрудника
	               |ИЗ
	               |	РегистрСведений.чартер_ЗаписьНаРейс КАК чартер_ЗаписьНаРейс
	               |ГДЕ
	               |	чартер_ЗаписьНаРейс.Рейс = &Рейс
	               |	И чартер_ЗаписьНаРейс.Сотрудник = &Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	чартер_Рейсы.Наименование КАК Наименование,
	               |	чартер_Рейсы.ДатаРейса КАК ДатаРейса,
	               |	чартер_Рейсы.МаршрутПерелета КАК МаршрутПерелета,
	               |	СТРОКА(чартер_Рейсы.Багаж) + "" кг"" КАК Багаж,
	               |	чартер_Рейсы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ втРейс
	               |ИЗ
	               |	Справочник.чартер_Рейсы КАК чартер_Рейсы
	               |ГДЕ
	               |	чартер_Рейсы.Ссылка = &Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРегистацияСоттрудника.Организация.Представление КАК Организация,
	               |	втРегистацияСоттрудника.ФИО КАК ФИО,
	               |	втРегистацияСоттрудника.ФИОАнглийское КАК ФИОАнглийское,
	               |	втРейс.ДатаРейса КАК ДатаРейса,
	               |	втРейс.МаршрутПерелета.Представление КАК Маршрут,
	               |	ВЫБОР
	               |		КОГДА втРегистацияСоттрудника.ДополнительныйБагаж
	               |			ТОГДА втРейс.Багаж + "" х 2""
	               |		ИНАЧЕ втРейс.Багаж
	               |	КОНЕЦ КАК Багаж,
	               |	втРегистацияСоттрудника.Место.Представление КАК Место,
	               |	втРейс.Наименование КАК НомерРейса,
	               |	втРегистацияСоттрудника.ДополнительныйБагаж КАК ДополнительныйБагаж
	               |ИЗ
	               |	втРегистацияСотрудника КАК втРегистацияСоттрудника
	               |		ПОЛНОЕ СОЕДИНЕНИЕ втРейс КАК втРейс
	               |		ПО втРегистацияСоттрудника.Рейс = втРейс.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьШаблонПосадочногоТалона(Класс)
	
	Результат = Неопределено;
	
    Если Класс = Перечисления.чартер_КлассыМестВС.БизнесКласс Тогда
		Результат = "чартер_БилетБизнесКласс";
	ИначеЕсли Класс = Перечисления.чартер_КлассыМестВС.ЭкономическийКлассУлучшенный Тогда	
		Результат = "чартер_КомфортКласс";
	ИначеЕсли Класс = Перечисления.чартер_КлассыМестВС.ЭкономическийКласс Тогда	
		Результат = "чартер_ЭкономКласс";
    Иначе
    	Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
